package com.naver.erp;

import java.util.List;
import java.util.Map;

public interface BoardDAO {

    // ****************************************************
    // [게시판 글 입력 후 입력 적용 행의 개수] 리턴하는 메소드 선언
    // ****************************************************
    int insertBoard(BoardDTO boardDTO);
	
    // ******************************************************
    // [검색한 게시판 목록] 리턴하는 메소드 선언
    // ******************************************************
    List<Map<String,String>> getBoardList( );

    // ******************************************************
    // [1개의 게시판 정보]를 리턴하는 메소드 선언
    // ******************************************************
    BoardDTO getBoard(int b_no);
    // ******************************************************
    // 조회수를 1 증가하고 업데이트한 행의 개수를 얻는 메소드 선언
    // ******************************************************
    int updateReadcount(int b_no);  



}
