//------------------------------------------------------------------------
// JSON 선언.
//------------------------------------------------------------------------
var weekMsg = {
    "월요일" : "월요일은 9시에 회의가 있는 날입니다. 보고서 준비해 주십시오."
    ,"화요일" : "화요일은 대청소 날입니다." 
    ,"수요일" : "수요일은 봉사활동 날입니다."
    ,"목요일" : "목요일은 부서별 회식이 있습니다."
    ,"금요일" : "금요일은 오후 12시에 대강의실에서 상 수여식이 있습니다."
}


//------------------------------------------------------------------------
// 2차원 Array 객체 생성하고 변수 scheduleMsg 에 저장하기.
//------------------------------------------------------------------------
var scheduleMsg = [
    ["2021-07-2 0" , "7월 20일 오늘은 36도까지 올라갑니다. 주의요망!"]
    ,["2021-07-2 0" , "7월 20일 오늘은 사장님 생일입니다."]
    ,["2021-07-21", " 오늘은 7월 21일 입니다. "]
    ,["2021-07-22", " 오늘은 7월 22일 입니다. "]
    ,["2021-07-23" , "7월 23일 휴강일 입니다."]
    ,["2021-08-13" , "8월 13일 휴강일 입니다."]
    ,["2021-08-16" , "8월 16일 휴강일 입니다."]
    ,["2021-11-03" , "11월 03일 창립기념일 입니다."]
]

//------------------------------------------------------------------------
// 명언을 랜덤하게 나오게 하기.
//------------------------------------------------------------------------

var goldenSaying = [
    "노력은 배신하지 않는다."
    ,"피할수 없으면 즐겨라.-로버트 엘리엇"
    ,"당신이 보낸 헌된 하루는 어제 죽은자가 그토록 바라던 내일이었다."
    ,"신념은 기적을 만들고, 훈련은 천재를 만든다."
    ,"오랫동안 꿈을 그리는 사람은 마친내 그 꿈을 닮아간다.-앙드레 말로"
    ,"고통이 남기고 간 뒤를 보라! 고난이 지나면 반드시 기쁨이 스며든다.-괴테"
    ,"마음만을 가지고 있어서는 안된다. 반드시 실천하여야 한다.-이소룡"
    ,"모든 인생문제의 정답은 상식적이라는 형용사를 붙여 생각하면 나옵니다."
    ,"강한자는 남에게 관대하고 자신에게 철저한 사람입니다. 항상 자신에게 관대함을 베풀지 마시길 바랍니다."
    ,"잘할 생각보단 동일한 실수를 하지 않으면 됩니다."
    ,"멀리 있는 목표를 보지 말고 이번주 목표를 보고 달리십시요. 이게 멀리 있는 목표를 달성하는 방법입니다."
    ,"기회는 자기 소개서를 보내지 않는다."
    ,"나는 미래에 대해 생각하는 법이 없다. 어차피 곧 닥치니까"
    ,"인내할 수있는 사람은 그가 바라는 것은 무엇이든지 손에 넣을 수 있다."
    ,"마음만을 가지고 있어서는 안된다. 반드시 실천하여야 한다."
    ,"천재성에는 한계가 있을 수 있지만 어리석음에는 이런 장애가 없다."
    ,"고통이 남기고 간 뒤를 보라! 고난이 지나면 반드시 기쁨이 스며든다."
    ,"노력하는 과정에 성과에 집착 말기. 지겨워지니까."
    ,"성공을 갉아먹는 벌레가 하나 있다. 그것은 바로 '대충'이다."
];


//------------------------------------------------------------------------
// D-Day 나오게 하기.
//------------------------------------------------------------------------

var dDayMsg = [
    ["2021-07-23" , "휴강일"]
    ,["2021-07-24", "토요일"]
    ,["2021-08-13" , "휴강일"]
    ,["2021-08-16" , "휴강일"]
    ,["2021-11-03" , "창립기념일"]
]